'use strict';


{

    console.log('Задание №1 "Вывести числа от 4 до 400 на экран."');

    for (let i = 4; i <= 400; i++) {
        console.log(i);
    }

}

//************************************************************************************************

{
    console.log('Задание №2 "Вывести числа в последовательности: 4 7 10 13 с помощью цикла."');

    for (let i = 4; i <= 13; i += 3) {
        console.log(i);
    }

}

//!************************************************************************************************

{
    console.log('Задание №3 "Вывести числа 654 653 652 до нуля."');

    for (let i = 654; i >= 0; i--) {
        console.log(i);
    }
}

//!************************************************************************************************

{
    console.log('Задание №4 "Вывести все годы с 1983 до 2017."');

    for (let i = 1983; i <= 2017; i++) {
        console.log(i + ' год');
    }
}

//!************************************************************************************************

{
    console.log('Задание №5 "Вывести числа -4 -2 0 2 4 6 ...100."');


    for (let i = -4; i <= 100; i += 2) {
        console.log(i)
    }
}

//!************************************************************************************************

{
    console.log('Задание №6 "С помощью цикла напечатайте таблицу умножения на 7 от 1 до 9."');


    for (let i = 1; i <= 9; i++) {
        console.log("7 * " + i + " = " + (i * 7));
    }
}

//!************************************************************************************************


{
    console.log('Задание №7 "Выведите с помощью цикла коды спецсимволов от 1000 до 2000"');


    for (let i = 1000; i <= 2000; i++) {
        document.write("&#" + i);
        if (i % 10 === 0) {
            document.write("<br>")
        }
    }
}

//!************************************************************************************************

{

    console.log('Задание №8 "Найти сумму чисел от 0 до 100 (включительно)"');

    let sum = 0;

    for (let i = 0; i <= 100; i++) {
        sum += i;
    }

    console.log(sum);

}

//!************************************************************************************************

{

    console.log('Задание №9 "С помощью цикла вывести произведение чисел от 1 до 50"');

    let result = 1;

    for (let i = 1; i <= 50; i++) {
        result *= i;
    }

    console.log(BigInt(result));
}

//!************************************************************************************************

{
    console.log('Задание №10 "Заполните массив следующим образом: в первый элемент запишите \'x\', во второй \'xx\', в третий \'xxx\' и так далее. Длину массива вводить через prompt"');

    let arr = new Array(parseFloat(prompt('Введите длинну массива:')));
    let elem = 'x';

    for (let i = 0; i < arr.length; i++) {
        arr[i] = elem;
        elem += 'x';
    }
    console.log(arr);
}

//!************************************************************************************************

{
    console.log('Задание №11 "Заполните массив следующим образом: в первый элемент запишите \'1\', во второй \'22\', в третий \'333\' и так далее. Длину массива вводить через prompt."');

    let arr = [];
    let count = parseFloat(prompt('Введите длинну массива:'));

    for (let i = 1; i <= count; i++) {
        let string = '';
        for (let j = 1; j <= i; j++) {
            string += String(i);
        }
        arr.push(string);
    }
    console.log(arr);

}

//!************************************************************************************************

{
    console.log('Задание №12 "Дан массив с числами. Узнайте сколько элементов с начала массива надо сложить, чтобы в сумме получилось больше 10-ти."');


    let arrNumbers = [5, 1, 2, 3, 4, 5];
    let sum = 0;
    let count = 0;
    for (let elem of arrNumbers) {
        if (sum < 10) {
            sum += elem;
            count++;
        }
    }
    console.log('Количество элементов которые необходимо сложить: ' + count);
}

//!************************************************************************************************

{
    console.log('Задание №13 "Дан массив с числами. Не используя метода reverse переверните его элементы в обратном порядке."');

    let arrNumbers = [5, 1, 2, 3, 4, 5];

    for (let i = arrNumbers.length - 1; i >= 0; i--) {
        console.log(arrNumbers[i]);
    }
}

//!************************************************************************************************

{
    console.log('Задание №14 "Дан массив с числами. Запишите в новый массив только те числа, которые больше нуля и меньше 10-ти."');

    let arrNumbers = [1, 2, 3, 4, 5, 150, 15];
    let arrNew = [];

    for (let elem of arrNumbers) {
        if (elem > 0 && elem < 10) {
            arrNew.push(elem)
        }
    }
    console.log(arrNumbers);
    console.log(arrNew);


}

//!************************************************************************************************

{
    console.log('Задание №15 "Дан массив с целыми числами. Создайте из него новый массив, где останутся лежать только четные из этих чисел."');

    let arrNumbers = [1, 2, 3, 4, 5, 150, 15];
    let arrNew = [];

    for (let i = 0; i < arrNumbers.length; i++) {
        if (arrNumbers[i] % 2 === 0) {
            arrNew.push(arrNumbers[i])
        }
    }
    console.log(arrNumbers);
    console.log(arrNew);
}

//!************************************************************************************************

{
    console.log('Задание №16 "Дан массив [1, 2, 3, 4, 5, 6]. Сделать из него массив [2, 1, 4, 3, 6, 5]"');

    let arrNumbers = [1, 2, 3, 4, 5, 6];
    let arrNew = [];

    for (let i = 0; i < arrNumbers.length; i++) {
        if (arrNumbers[i] % 2 === 0) {
            arrNew.splice(i - 1, 0, i + 1)
        } else {
            arrNew.push(i + 1)
        }
    }
    console.log(arrNumbers);
    console.log(arrNew);
}

//!************************************************************************************************

{

    console.log('Задание №17 "Дан массив [1, 2, 3, 4, 5, 6]. Сделать из него массив [5, 6, 3, 4, 1, 2]"');

    let arrNumbers = [1, 2, 3, 4, 5, 6];
    let arrNew = [];
    for (let i = 0; i < arrNumbers.length; i++) {
        if (arrNumbers[i] % 2 === 1) {
            arrNew.splice(0, 0, i + 1)
        } else {
            arrNew.splice(1, 0, i + 1)
        }
    }
    console.log(arrNumbers);
    console.log(arrNew);

}

//!************************************************************************************************

{
    console.log('Задание №18 "Дан двухмерный массив с числами, например [[1, 2, 3], [4, 5], [6]]. Найдите сумму элементов этого массива."');

    {
        let arr = [[1, 2, 3], [4, 5], [6]];
        let sum = 0;

        for (let bloc of arr) {
            for (let elem of bloc) {
                sum += elem;
            }
        }
        console.log(sum);
    }
}


{
    console.log('Задание №19 "Сформировать матрицу"');

    let matrix = [];
    let size = 10;

    for (let i = 0; i < size; i++) {
        let arr = [];
        for (let j = 0; j < size; j++) {
            arr[j] = (i + 1) * (j + 1)
        }
        matrix.push(arr)
    }
    console.log(matrix)
}