'use strict'
/*
Задача 1. Вывести числа от 4 до 400 на экран.
*/
{
    let n = 4
    while (n <= 400) {
        console.log(n++)
    }
}

/*
Задача 2. Вывести числа в последовательности: 4 7 10 13 с помощью цикла.
*/
{
    let n = 1
    while (n < 13) {
        console.log(n += 3)
    }
}

/*
Задача 3. Вывести числа 654 653 652 до нуля.
*/
{
    let n = 654
    while (n >= 0) {
        console.log(n--)
    }
}

/*
Задача 4. Вывести все годы с 1983 до 2017.
*/
{
    let n = 1983
    while (n <= 2017) {
        console.log(n++)
    }
}

/*
Задача 5. Вывести числа -4 -2 0 2 4 6 ...100.
*/
{
    let n = -4
    while (n <= 100) {
        console.log(n)
        n +=2
    }
}

/*
Задача 6. С помощью цикла напечатайте таблицу умножения на 7 от 1 до 9.
*/
{
    let n = 7
    let s = 1
    while (s <= 9) {
        let r = s*n
        console.log(`7 * ${s} = ${r}`)
        s++
    }
}

/*
Задача 7. Выведите с помощью цикла коды спецсимволов от 1000 до 2000. Напомню, что спецсимвол получается комбинацией &#число; Например ӆ
*/
{
    let n = 1000
    while (n <= 2000) {
        console.log(`&#${n++}`)
    }
}

/*
Задача 8. Найти сумму чисел от 0 до 100 (включительно). (0+1+2+3+4+5).
*/
{
    let s = 0 , i = 1
    while (i <= 100) {
        s += i++
    }
    alert(s)
}

/*
Задача 9. С помощью цикла вывести произведение чисел от 1 до 50.
*/
{
    let p = 1n , i = 1n
    while (i <= 50n) {
        p *= i++
    }
    console.log(p)
}

/*
Задача 10. Заполните массив следующим образом: в первый элемент запишите 'x', во второй 'xx',
в третий 'xxx' и так далее. Длину массива вводить через prompt.
*/
{
    let m = []
    let dl = parseFloat(prompt(`Введите длину масива`))
    let x = ""
    
    for (let i = 1; i <= dl; i++){
        x += "x"
        m.push(x)
    }
    console.log(m)
}

/*
Задача 11. Заполните массив следующим образом: в первый элемент запишите '1', во второй '22', в третий '333' и так далее. Длину массива вводить через prompt.
*/
{
    let m = []
    let dl = parseFloat(prompt(`Введите длину масива`))
        
    for (let i = 1; i <= dl; i++){
        let x = ""
        for ( let p = 1; p <= i; p++){
            x += i
        }
        m.push(x)
    }
    console.log(m)
}

/*
Задача 12. Дан массив с числами. Узнайте сколько элементов с начала массива надо сложить, чтобы в сумме получилось больше 10-ти.
*/
{
    let m = [1,2,3,0,5,6,7,8,9]
    let i = 0
    let sum = 0
            
    while (i < m.length && sum < 10){
        sum += m[i++]
    }
    console.log(i)
}

/*
Задача 13. Дан массив с числами. Не используя метода reverse переверните его элементы в обратном порядке.
*/
{
    let m = [1,2,3,0,5,6,7,8,9]
    let m2 = []        
    
    for (let i = m.length-1; i >= 0 ; i--){
        m2.push(m[i])
    }
    m = m2
    console.log(m)
}

/*
Задача 14. Дан массив с числами. Запишите в новый массив только те числа, которые больше нуля и меньше 10-ти.
*/
{
    let m = [1,22,3,0,55,7,66,77,85,49]
    let m2 = []        
    
    for (let i = 0; i <= m.length ; i++){
        if (m[i] > 0 && m[i] < 10){
        m2.push(m[i])
        }
    }    
    console.log(m2)
}

/*
Задача 15. Дан массив с целыми числами. Создайте из него новый массив, где останутся лежать только четные из этих чисел.
*/
{
    let m = [1,22,3,0,55,7,66,77,85,49]
    let m2 = []        
    
    for (let i = 0; i <= m.length ; i++){
        if (m[i]%2==0 && m[i]!=0){
        m2.push(m[i])
        }
    }    
    console.log(m2)
}

/*
Задача 16.Дан массив [1, 2, 3, 4, 5, 6]. Сделать из него массив [2, 1, 4, 3, 6, 5]
*/
{
    let m = [1, 2, 3, 4, 5, 6]
        
    for (let i = 0; i <= m.length-1 ; i+=2){
        m.splice(i, 2, m[i+1], m[i] );
    }    
    console.log(m)
}

/*
Задача 17.Дан массив [1, 2, 3, 4, 5, 6]. Сделать из него массив [5, 6, 3, 4, 1, 2]
*/
{
    let m = [1, 2, 3, 4, 5, 6]
    let m2 = []

    for (let i = m.length-1; i >= 0; i-=2){
        m2.push(m[i-1], m[i])
    }
    m=m2   
    console.log(m)
}

/*
Задача 18.Дан двухмерный массив с числами, например [[1, 2, 3], [4, 5], [6]]. 
Найдите сумму элементов этого массива. Массив, конечно же, может быть произвольным.
*/

{
    let m = [[1, 2, 3], [4, 5], [6]]
    let sum = 0

    for (let i of m){
        for (let el of i){
            sum += el
            }
    }
    console.log(sum)
}

/*
Задача 19.Сформировать 3 матрицы изображенные на картинке
*/
// 1
{
    const size = 10;
    const m = [];
  
    for (let row = 0; row < size; row++) {
      m[row] = [];
      for (let cel = 0; cel < size; cel++) {
        m[row][cel] = (row + 1) * (cel + 1)
      }
    }
    console.log(m)
}

// 2
{
    const size = 10
    const m = []
  
    for (let row = 0; row < size; row++) {
      m[row] = []
      for (let cel = 0; cel < size; cel++) {
        if (row == cel){
        m[row][cel] = 1
        }
        else if ((row + cel) == size-1){
            m[row][cel] = 2
        }
        else if ((row + cel) <= 8 && (cel - row) < 0){
            m[row][cel] = 6
        }
        else if ((cel + row) <= 8 && (row - cel) <= 8) {
            m[row][cel] = 3
        }
        else if ((cel - row) <= 8 && (cel - row) > 0) {
            m[row][cel] = 4
        }
        else {
            m[row][cel] = 5
        }
    }
    }
    console.log(m)
}

// 3
{
    let m = []
    const size = 10

    for (let row = 0; row < size; row++) {
        m[row] = []
        for (let cel = 0; cel <= row; cel++) {
            if (row == cel || cel == 0) {
                m[row][cel] = 1
            } else {
                m[row][cel] = m[row - 1][cel - 1] + m[row - 1][cel]
            }
        }
    }
    console.log(m)
}
